Интенсивное_обучение_программированию/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Интенсивное_обучение_программированию/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <comment>Расходная накладная покупателю</comment>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокУслуг</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/Documents/ПроизводствоПродукции/ПроизводствоПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводствоПродукции</name>
  <comment>Производство продукции сотрудником</comment>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Интенсивное_обучение_программированию/src/AccumulationRegisters/ОстаткиНоменклатуры/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьОтрицательныеОстаткиТовара(СсылкаНаРН, ДатаОтбора) Экспорт
	
	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая);
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ДатаОтбора, Номенклатура В
		|		(ВЫБРАТЬ
		|			РасходнаяНакладнаяСписокТоваров.Товар КАК Товар
		|		ИЗ
		|			Документ.РасходнаяНакладная.СписокТоваров КАК РасходнаяНакладнаяСписокТоваров
		|		ГДЕ
		|			РасходнаяНакладнаяСписокТоваров.Ссылка = &СсылкаРН)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
			
	Запрос.УстановитьПараметр("СсылкаРН", СсылкаНаРН);
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	РезультатЗапроса = Запрос.Выполнить();

		Если РезультатЗапроса.Пустой() Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаВывода = СтрШаблон("Не хватает товара ""%1"" в количестве %2 шт.",
						ВыборкаДетальныеЗаписи.Номенклатура, -(ВыборкаДетальныеЗаписи.КоличествоОстаток));
			Сообщить(СтрокаВывода);
			
		КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьОтрицательныеОстаткиМатериала(СсылкаНаПП, ДатаОтбора) Экспорт
	
	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая);
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ДатаОтбора, Номенклатура В
		|		(ВЫБРАТЬ
		|			ПроизводствоПродукцииСписокМатериалов.Материал КАК Материал
		|		ИЗ
		|			Документ.ПроизводствоПродукции.СписокМатериалов КАК ПроизводствоПродукцииСписокМатериалов
		|		ГДЕ
		|			ПроизводствоПродукцииСписокМатериалов.Ссылка = &СсылкаПП)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
			
	Запрос.УстановитьПараметр("СсылкаПП", СсылкаНаПП);
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	РезультатЗапроса = Запрос.Выполнить();

		Если РезультатЗапроса.Пустой() Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаВывода = СтрШаблон("Не хватает товара ""%1"" в количестве %2 единиц.",
						ВыборкаДетальныеЗаписи.Номенклатура, -(ВыборкаДетальныеЗаписи.КоличествоОстаток));
			Сообщить(СтрокаВывода);
			
		КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
